Autodesk.Revit.DB.Structure.RebarShape.GetParamDefinedBySpiralDiameterFormula
Gets the shared parameters that are defined as forumulas that are equal to spiral diameter.
Returns:
Returns the shared parameters that are defined as forumulas that are equal to spiral diameter.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamDefinedBySpiralPitchFormula
Gets the shared parameters that are defined as forumulas that are equal to spiral pitch.
Returns:
Returns the shared parameters that are defined as forumulas that are equal to spiral pitch.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamDefinedBySpiralHeightFormula
Gets the shared parameters that are defined as forumulas that are equal to spiral height.
Returns:
Returns the shared parameters that are defined as forumulas that are equal to spiral height.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetParamsDefinedByHookFormulasAtEnd(System.Int32)
Gets the shared parameters that are defined as forumulas that are equal to hook at length, hook offset, hook tanglent length at the specified end.
Returns:
Returns the shared parameters that are defined as forumulas that are equal to hook at length, hook offset, hook tanglent length at the specified end.
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.HasEndTreatment
Identifies if the rebar shape has end treatment at at least one end.
Returns:
Returns true if the rebar shape has end treatment for at least one end, false otherwise.
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.SetEndTreatmentTypeId(Autodesk.Revit.DB.ElementId,System.Int32)
Sets the EndTreatmentType id at the specified rebar shape end.
endTreatmentId:
The id of an EndTreatmentType element, or invalidElementId if the rebar shape should have no end treatment at the specified end.
iEnd:
0 for the start end treatment, 1 for the end end treatment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iEnd not a valid shape end
-or-
the parameter endTreatmentId is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.GetEndTreatmentTypeId(System.Int32)
Gets the id of the EndTreatmentType at the specified rebar shape end.
iEnd:
0 for the start end treatment, 1 for the end end treatment.
Returns:
Returns the id of an EndTreatmentType, or invalidElementId if the rebar shape has no end treatment at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iEnd not a valid shape end
Since:
2017

Autodesk.Revit.DB.Structure.RebarShape.IsSameShapeIgnoringHooks(Autodesk.Revit.DB.Structure.RebarShape)
Test whether two shapes have equivalent definitions by comparing
the RebarShapeDefinition and MultiplanarDefinition properties.
Remarks:
This method will return true if the definitions are exactly
equivalent, or if they are equivalent but have the opposite
start/end orientation.
Replaces the property RebarShape.SameShapeIgnoringHooks from prior releases.
otherShape:
Another shape to be compared to this one.
Returns:
True if the shape definitions match, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.SetHookRotationAngle(System.Double,System.Int32)
Sets the out of plane hook rotation angle at the specified end.
hookRotationAngle:
The out of plane hook rotation angle at the specified end.
iEnd:
0 for the start , 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
Since:
2021

Autodesk.Revit.DB.Structure.RebarShape.GetHookRotationAngle(System.Int32)
Gets the out of plane hook rotation angle at the specified end.
iEnd:
0 for the start , 1 for the end.
Returns:
Returns the out of plane hook rotation angle at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
Since:
2021

Autodesk.Revit.DB.Structure.RebarShape.GetAllowed(Autodesk.Revit.DB.Structure.RebarBarType)
Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
barType:
A bar type in the same document as this shape.
Returns:
True if this shape may be combined with this barType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.SetAllowed(Autodesk.Revit.DB.Structure.RebarBarType,System.Boolean)
Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
barType:
A bar type in the same document as this shape.
allowed:
Whether this shape may be combined with barType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShape.GetMultiplanarDefinition
The optional 3D structure of the shape.
Returns:
A copy of the multiplanar definition. Changes will not affect the RebarShape.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
startHookAngle:
The start hook angle, expressed as an integral number of degrees.
If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.
startHookOrientation:
The orientation of the start hook.
Ignored when startHookAngle is 0.
endHookAngle:
The end hook angle, expressed as an integral number of degrees.
If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.
endHookOrientation:
The orientation of the end hook.
Ignored when endHookAngle is 0.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
startHookAngle must be at least 0 and no more than 180.
-or-
endHookAngle must be at least 0 and no more than 180.
-or-
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.Structure.RebarShape.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShapeDefinition,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.StirrupTieAttachmentType,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Int32)
Create a new instance of a Rebar Shape, which defines the shape of a rebar.
doc:
A document to contain the RebarShape.
definition:
The definition of the rebar shape, as a set of curves in a plane
driven by parameters.
multiplanarDefinition:
If not null, the created RebarShape will be a 3D shape. The shape
is built out of the planar RebarShapeDefinition, with additional
out-of-plane segments defined by the RebarShapeMultiplanarDefinition
object. Not supported in conjunction with RebarShapeDefinitionByArc
of type Spiral or LappedCircle.
style:
Whether the shape is to be used as a standard bar or a stirrup/tie.
attachmentType:
When the style is stirrup/tie, specify whether it will attach to the
interior of cover (cover is measured to the stirrups), or to the
exterior of cover (cover is measured to the standard bars).
Ignored when the style is Standard.
startHookAngle:
The start hook angle, expressed as an integral number of degrees.
If 0, the shape will have no start hook. Common values are 0, 90, 135, and 180.
startHookOrientation:
The orientation of the start hook.
Ignored when startHookAngle is 0.
endHookAngle:
The end hook angle, expressed as an integral number of degrees.
If 0, the shape will have no end hook. Common values are 0, 90, 135, and 180.
endHookOrientation:
The orientation of the end hook.
Ignored when endHookAngle is 0.
higherEnd:
When the rebar crosses itself, one end will be "lifted" to avoid self-intersection.
Specify which end should be lifted: 0 for start, 1 for end.
Returns:
A new RebarShape instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
definition is linked to a Document other than doc.
-or-
A multiplanar definition is specified when the given RebarShapeDefinition
does not support it. The following RebarShapeDefinitions do not support
multiplanar: a simple line; spiral; lapped circle.
-or-
The DepthParamId property of multiplanarDefinition
is invalid or has not been added to definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
startHookAngle must be at least 0 and no more than 180.
-or-
endHookAngle must be at least 0 and no more than 180.
-or-
higherEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShape.HasOnlyPerpendicularSegments
Identifies if any two adjacent segments are perpendicular or not. If the bar segments are other than lines, this property is false.
Since:
2009